Мониторинг/src/DataProcessors/ОбменМониторингРозница/ОбменМониторингРозница.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбменМониторингРозница</name>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

Мониторинг/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииЦен</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Мониторинг/src/InformationRegisters/СебестоимостьНоменклатуры/СебестоимостьНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СебестоимостьНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Мониторинг/src/DataProcessors/ОбменМониторингРозница/Forms/Форма/Module.bsl
&НаСервере
Процедура ВыполнитьОбменНаСервере()
	
	ИП				= Константы.РозницаИП.Получить();
	Пользователь	= Константы.РозницаПользователь.Получить();
	Пароль			= Константы.РозницаПароль.Получить();
	
	Определение = Новый WSОпределения("http://" + ИП + "/ws/Monitor.1cws?wsdl", Пользователь, Пароль);
	
	Прокси = Новый WSПрокси(Определение,
	
	"MonitorURL",
	
	"Мониторинг",
	
	"МониторингSoap");
	Прокси.Пользователь = Пользователь;
	Прокси.Пароль = Пароль;
	
	//Синхронизация справочников
	СписокСправочник = Прокси.СинхронизацияСправочников();
	Для Каждого Стр Из СписокСправочник.СтрокаСправочник Цикл
		
		Если Стр.ВидСправочника = "Номенклатура" Тогда
			
			СтрокаGUID = Стр.ГУИД;
			ГУИД = Новый УникальныйИдентификатор(СтрокаGUID); 
			НСпр = Справочники.Номенклатура.ПолучитьСсылку(ГУИД);
			
			Если НСпр.Код = "" Тогда
				
				Если Стр.ЭтоГруппа Тогда
					Спр = Справочники.Номенклатура.СоздатьГруппу();
				Иначе	
					Спр = Справочники.Номенклатура.СоздатьЭлемент();
				КонецЕсли;
				
				Спр.УстановитьСсылкуНового(НСпр); 

			Иначе
				Спр = НСпр.Ссылка.ПолучитьОбъект();
			КонецЕсли;	
			
			СтрокаGUID = Стр.ГУИДРодителя;
			ГУИД = Новый УникальныйИдентификатор(СтрокаGUID);
			
			Если Не Справочники.Номенклатура.ПолучитьСсылку(ГУИД).Код = "" Тогда
				Спр.Родитель = Справочники.Номенклатура.ПолучитьСсылку(ГУИД);
			КонецЕсли;
			
			Если Не Спр.ЭтоГруппа Тогда
				Спр.Фотография		= Стр.Фото; 
			КонецЕсли;
		
			Спр.Код				= Стр.Код;
			Спр.Наименование	= Стр.Наименование;
			Спр.Записать(); 
			
		ИначеЕсли Стр.ВидСправочника = "Магазины" Тогда
			
			СтрокаGUID = Стр.ГУИД;
			ГУИД = Новый УникальныйИдентификатор(СтрокаGUID); 
			НСпр = Справочники.Магазины.ПолучитьСсылку(ГУИД);
			
			Если НСпр.Код = "" Тогда
				Спр = Справочники.Магазины.СоздатьЭлемент();
				Спр.УстановитьСсылкуНового(НСпр); 
			Иначе
				Спр = НСпр.Ссылка.ПолучитьОбъект();
			КонецЕсли;	
			
			Спр.Код = Стр.Код;
			Спр.Наименование = Стр.Наименование;
			Спр.Записать();
			
		ИначеЕсли Стр.ВидСправочника = "КатегорииНоменклатуры" Тогда
			
			СтрокаGUID = Стр.ГУИД;
			ГУИД = Новый УникальныйИдентификатор(СтрокаGUID); 
			НСпр = Справочники.КатегорииЦен.ПолучитьСсылку(ГУИД);
			
			Если НСпр.Код = "" Тогда
				Спр = Справочники.КатегорииЦен.СоздатьЭлемент();
				Спр.УстановитьСсылкуНового(НСпр); 
			Иначе
				Спр = НСпр.Ссылка.ПолучитьОбъект();
			КонецЕсли;	
			
			Спр.Код = Стр.Код;
			Спр.Наименование = Стр.Наименование;
			Спр.Записать();
	
		КонецЕсли;
		
	КонецЦикла;	
	
	//Заполнение регистров
	//ДатаСинхронизации = ТекущаяДата();
	ДатаСинхронизации = Объект.Дата;
	
	СписокРегистр = Прокси.СинхронизацияРегистров(ДатаСинхронизации);
	
	НаборЗаписейЦН = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();  			
	НаборЗаписейЦН.Отбор.Период.Установить(ДатаСинхронизации);
	НаборЗаписейЦН.Прочитать();
	НаборЗаписейЦН.Очистить();
	НаборЗаписейЦН.Записать();
	
	НаборЗаписейСН = РегистрыСведений.СебестоимостьНоменклатуры.СоздатьНаборЗаписей();  			
	НаборЗаписейСН.Отбор.Период.Установить(ДатаСинхронизации);
	НаборЗаписейСН.Прочитать();
	НаборЗаписейСН.Очистить();
	НаборЗаписейСН.Записать();
	
	Для Каждого Стр Из СписокРегистр.СтрокаРегистр Цикл
		
		Если Стр.ТипРегистра = "ЦеныНоменклатуры" Тогда
			
			НоваяЗапись = НаборЗаписейЦН.Добавить();
			НоваяЗапись.Период					= Стр.Период;
			
			СтрокаGUID = Стр.Магазин;
			ГУИД = Новый УникальныйИдентификатор(СтрокаGUID); 
			НСпр = Справочники.Магазины.ПолучитьСсылку(ГУИД);
			НоваяЗапись.Магазин					= НСпр;
			
			СтрокаGUID = Стр.Номенклатура;
			ГУИД = Новый УникальныйИдентификатор(СтрокаGUID); 
			НСпр = Справочники.Номенклатура.ПолучитьСсылку(ГУИД);
			НоваяЗапись.Номенклатура			= НСпр;
			
			СтрокаGUID = Стр.КатегорияНоменклатуры;
			ГУИД = Новый УникальныйИдентификатор(СтрокаGUID); 
			НСпр = Справочники.КатегорииЦен.ПолучитьСсылку(ГУИД);
			НоваяЗапись.КатегорияНоменклатуры	= НСпр;
			
			НоваяЗапись.Цена					= Стр.Цена;
			
		ИначеЕсли Стр.ТипРегистра = "СебестоимостьНоменклатуры" Тогда
			
			НоваяЗапись = НаборЗаписейСН.Добавить();
			НоваяЗапись.Период					= Стр.Период;
			
			СтрокаGUID = Стр.Магазин;
			ГУИД = Новый УникальныйИдентификатор(СтрокаGUID); 
			НСпр = Справочники.Магазины.ПолучитьСсылку(ГУИД);
			НоваяЗапись.Магазин					= НСпр;
			
			СтрокаGUID = Стр.Номенклатура;
			ГУИД = Новый УникальныйИдентификатор(СтрокаGUID); 
			НСпр = Справочники.Номенклатура.ПолучитьСсылку(ГУИД);
			НоваяЗапись.Номенклатура			= НСпр;
			
			НоваяЗапись.Цена					= Стр.Цена;	
		КонецЕсли;
		
	КонецЦикла;	
	
	НаборЗаписейЦН.Записать();
	НаборЗаписейСН.Записать();
	
	УдалениеРегистрации = Прокси.УдалитьРегистрацию();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	ВыполнитьОбменНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Объект.Дата = ТекущаяДата();
КонецПроцедуры
